[{
  "_id": {
    "$oid": "60bc701f88ee043b7453e30b"
  },
  "listImage": [],
  "listSubject": [
    "วิทยาศาสตร์ และเทคโนโลยี"
  ],
  "listTag": [
    "Datetime",
    "Javascript"
  ],
  "listAnswer": [],
  "listComment": [],
  "whoVoteLike": [],
  "whoVoteDislike": [],
  "forumID": "1",
  "userID": "1",
  "title": "[JS] จะเปลี่ยน date time เป็น format ภาษาไทย ต้องแก้ตรงไหน ?",
  "postText": "<p>จะเปลี่ยน date time เป็น format ภาษาไทย ต้องแก้ตรงไหนครับ</p><p>var datetime = null,<br>&nbsp; &nbsp; date = null;<br>&nbsp; var update = function() {<br>&nbsp; &nbsp; date = moment(new Date())<br>&nbsp; &nbsp; datetime.html(date.format('dddd, D MMMM &nbsp;YYYY, h:mm:ss a'));<br>&nbsp; };<br>&nbsp; datetime = $('#time-date')<br>&nbsp; update();<br>&nbsp; setInterval(update, 1000);</p>",
  "createdAt": {
    "$date": "2021-06-06T06:50:07.336Z"
  },
  "updatedAt": {
    "$date": "2021-06-06T06:50:07.336Z"
  }
},{
  "_id": {
    "$oid": "60bc719b88ee043b7453e310"
  },
  "listImage": [
    {
      "fileName": "download.jpeg",
      "filePath": "uploads\\2021-06-06T06-56-27.863Z-download.jpeg",
      "fileType": "image/jpeg",
      "fileSize": "57.77 KB"
    }
  ],
  "listSubject": [
    "วิทยาศาสตร์ และเทคโนโลยี"
  ],
  "listTag": [
    "jQuery ",
    "Database"
  ],
  "listAnswer": [],
  "listComment": [],
  "whoVoteLike": [],
  "whoVoteDislike": [],
  "forumID": "2",
  "userID": "2",
  "title": "สอบถามเรื่อง jQuery เลือกแล้วส่งค่าไปยัง input ที่มี id เหมือนกัน ไม่ทราบว่ามีวิธีไหนบ้าง",
  "postText": "<p>ตามภาพ เมื่อผมแสดงข้อมูลจาก db ออกมาแล้วมี 2 ข้อมูล คราวนี้ผมต้องการ</p><p>เมื่อผมเลือกช่องผลการดำเนินงานข้อมูลที่ 1 -&gt; เป็น ดำเนินการเรียบร้อยแล้ว อยากให้ข้อมูลไปมันไปแสดงที่ช่อง&nbsp;<br>ผล % ความก้าวหน้า เป็น 100</p><p>แล้วข้อมูลที่ 2 -&gt; เป็น &nbsp;ยังไม่กำเนินการ อยากให้ข้อมูลไปมันไปแสดงที่ช่อง&nbsp;<br>ผล % ความก้าวหน้า เป็น 0</p><p>โดยที่ input ทั้งสอง ที่ผมกล่าวมา (ช่องผลการดำเนินงาน) และ (ผล % ความก้าวหน้า) มีชื่อและไอดีเหมือนกัน<br>เราจะเขียน jQuery ยังไงครับ ผมลองทำโดยอ้างจากไอดีก็ไม่ได้ มันจะขึ้นอันแรกอันเดียว</p><p>รบกวนด้วยครับ ขอบคุณครับ</p>",
  "createdAt": {
    "$date": "2021-06-06T06:56:27.911Z"
  },
  "updatedAt": {
    "$date": "2021-06-06T06:56:27.911Z"
  }
},{
  "_id": {
    "$oid": "60bc72ba88ee043b7453e312"
  },
  "listImage": [],
  "listSubject": [
    "วิทยาศาสตร์ และเทคโนโลยี"
  ],
  "listTag": [
    "PHP"
  ],
  "listAnswer": [],
  "listComment": [],
  "whoVoteLike": [],
  "whoVoteDislike": [],
  "forumID": "3",
  "userID": "3",
  "title": "PHP เปลี่ยนชื่อ Folder บน Server ยังไง",
  "postText": "<p>สอบถามวิธีเปลี่ยนชื่อ Folder php หน่อยค่ะ พอดีโค้ดที่ทำมันไม่เปลี่ยนให้ค่ะ ผู้รู้ช่วยทีครับ</p><p>$Engine = \"RZ4E UW3425\";<br>$Engine1 = substr($Engine,-6);<br>$Folderold = \"106304-0122-\";<br>$Foldernew = \"106304-0122-\".$Engine1;<br>$bid ='10';<br><br>$Dirold = \"http://\".$_SERVER['HTTP_HOST'].\"/FileEdocument/\".$bid.\"/\".$Folderold;&nbsp;<br>$Dirnew = \"http://\".$_SERVER['HTTP_HOST'].\"/FileEdocument/\".$bid.\"/\".$Foldernew;<br>rename($Dirold,$Dirnew);</p><p><br>อันนี้คือโค้ดที่ใช้ครับ รันบน Server แล้วแต่ไม่มีการเปลี่ยนให้ อยากรู้ว่าต้องแก้ในส่วนไหนครับ</p>",
  "createdAt": {
    "$date": "2021-06-06T07:01:14.223Z"
  },
  "updatedAt": {
    "$date": "2021-06-06T07:01:14.223Z"
  }
},{
  "_id": {
    "$oid": "60bc75ca88ee043b7453e315"
  },
  "listImage": [
    {
      "fileName": "43F548FAA2FA4D78AAC7FAE9BA124E75.jpg",
      "filePath": "uploads\\2021-06-06T07-14-18.041Z-43F548FAA2FA4D78AAC7FAE9BA124E75.jpg",
      "fileType": "image/jpeg",
      "fileSize": "50.95 KB"
    }
  ],
  "listSubject": [
    "กฎหมาย",
    "วิทยาศาสตร์ และเทคโนโลยี"
  ],
  "listTag": [
    "  พรบ.คอมพิวเตอร์"
  ],
  "listAnswer": [],
  "listComment": [],
  "whoVoteLike": [],
  "whoVoteDislike": [],
  "forumID": "4",
  "userID": "4",
  "title": "แบบนี้ ถือบิดเบือน หลอกลวง และผิดกฎหมายคอมพ์ฉบับใหม่ ไหม",
  "postText": "<p>พวกคะนองปากท้าทายอำนาจรัฐโพสต์เฟซบุ๊กด่าหน่วยงานของรัฐเป็นประจำทุกวัน บิดเบือนเสนอข้อมูลด้านเดียว ด่าผู้อื่นหรือหน่วยงานรัฐ แสดงความคิดเห็นหรือคอมเมนต์ด่าบุคคลอื่น ผิดศีลธรรมหรือขัดต่อความสงบเรียบร้อย (เอามัน) เพื่อให้เกิดความวุ่นวายในบ้านเมือง ทุจริตหลอกลวงทางเฟซบุ๊กเพื่อแสวงหาประโยชน์ รวมถึงการโฆษณาขายสินค้า เจ้าของเฟซบุ๊ก เว็บไซต์ ถ้ามีความเห็นที่ผิดกฎหมายต้องลบออก มิฉะนั้นเตรียมติดคุกและเสียค่าปรับได้เลย ทนายคลายทุกข์ขอนำสาระสำคัญบางส่วนที่ผู้ใช้โซเชียลมีเดียต้องรู้<br>&nbsp;</p><ol><li>พวกส่งสแปมหาลูกค้าครั้งละหลายพันฉบับ (เมลขยะ) ในเวลาเดียวกัน โดยที่ผู้รับไม่ได้ยินยอมและไม่มีทางเลือกที่จะปฏิเสธ มาตรา 11 ปัจจุบันมีบริษัทขายตรงหรือบริษัทที่ให้บริการต่างๆ ส่งอีเมลครั้งละประมาณ 4,000-5,000 ฉบับไปยังกลุ่มเป้าหมาย สร้างความเดือดร้อนรำคาญให้แก่ผู้รับ ต่อไปนี้ไม่สามารถทำได้อีกต่อไปแล้ว ใครที่ทำก็ควรหยุดมิฉะนั้นก็จะถูกดำเนินคดีตามกฎหมายใหม่</li><li>เจ้าของเว็บไซต์ หรือเฟซบุ๊กที่เปิดให้คนทั่วไปได้แสดงความคิดเห็น โดยเฉพาะพวกที่มีคนติดตามเป็นแสน หากความเห็นผิดกฎหมาย มาตรา 15 เจ้าของเว็บไซต์ที่มีเว็บบอร์ดให้ตั้งกระทู้แสดงความคิดเห็นจะต้องคอยตรวจสอบว่าผู้ที่มาโพสต์ข้อความ โพสต์ข้อความที่ผิดกฎหมายหรือผิดศีลธรรม หรือขัดต่อความสงบเรียบร้อยหรือไม่อย่างไร หรือละเมิดสิทธิคนอื่น หรือมีข้อความลามกอนาจาร จะต้องคอยลบข้อมูลที่ผิดกฎหมายออกอยู่สม่ำเสมอ มิฉะนั้นจะมีความผิดตามกฎหมาย</li><li>กระทำต่อข้อมูลคอมพิวเตอร์เกี่ยวกับความมั่นคง หรือความปลอดภัยสาธารณะมาตรา 12</li><li>หลอกลวงหรือทุจริตหรือบิด เบือนหรือข้อมูลปลอม หรือข้อมูลเท็จ อันมิใช่ความผิดฐานหมิ่นประมาท มาตรา 14 (1) เป็นกรณีที่แสวงหาประโยชน์โดยมิชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น เช่น หลอกลวงขายสินค้าหรือบริการ หลอกให้โอนเงินเข้าบัญชีก่อนและไม่ส่งมอบสินค้า หรือหลอกลวงโดยปลอมตัวเป็นบุคคลอื่น ทำให้ได้เงินหรือทรัพย์สินไปจากประชาชน รวมทั้งการใช้ข้อมูลที่บิดเบือนความจริง เช่น บอกไม่หมด หรือความจริงครึ่งเดียว ทำให้การความเข้าใจผิด ได้เงินทองหรือทรัพย์สินไปจากประชาชน แต่ต้องมิใช่คดีหมิ่นประมาทตามประมวลกฎหมายอาญา ถ้ามีการกระทำความผิด เช่น ด่ากัน หรือเรื่องชู้สาว ก็ต้องไปดำเนินคดีตามประมวลกฎหมายอาญา มาตรา 326 หรือมาตรา 328 ไม่สามารถที่จะอ้างบทบัญญัติใหม่นี้ได้</li><li>ข้อมูลลามก เช่น ภาพโป๊ ภาพคนร่วมประเวณี ถ่ายทอดสดแก้ผ้า มาตรา 14 (4) การโพสต์ภาพลามก เช่นการแก้ผ้า ทั้งภาพนิ่ง และภาพเคลื่อนไหว หรือการถ่ายทอดสดโดยทยอยถอดเสื้อผ้าทีละชิ้น เพื่อกระชาก เรตติ้ง หรือยอดไลค์ ไม่สามารถทำได้อีกต่อไปแล้ว</li></ol>",
  "createdAt": {
    "$date": "2021-06-06T07:14:18.060Z"
  },
  "updatedAt": {
    "$date": "2021-06-06T07:14:18.060Z"
  }
},{
  "_id": {
    "$oid": "60bc803f88ee043b7453e318"
  },
  "listImage": [
    {
      "fileName": "download.jfif",
      "filePath": "uploads\\2021-06-06T07-58-55.472Z-download.jfif",
      "fileType": "image/jpeg",
      "fileSize": "6.42 KB"
    },
    {
      "fileName": "3BEE1AB3027A951384EB7545700F1269.jpg",
      "filePath": "uploads\\2021-06-06T07-58-55.476Z-3BEE1AB3027A951384EB7545700F1269.jpg",
      "fileType": "image/jpeg",
      "fileSize": "175.66 KB"
    }
  ],
  "listSubject": [
    "พาณิชยศาสตร์ และการบัญชี"
  ],
  "listTag": [
    "วัคซีน"
  ],
  "listAnswer": [],
  "listComment": [],
  "whoVoteLike": [],
  "whoVoteDislike": [],
  "forumID": "5",
  "userID": "5",
  "title": "‘จุรินทร์’ ร่วมวงถกเอเปค มุ่งฟื้นฟูเศรษฐกิจจากโควิด สนับสนุนใช้ CL ผลิตวัคซีนอย่างเท่าเทียมยกเว้นสิทธิบัตร ถูกต้องไหม ?",
  "postText": "<p>นายจุรินทร์ &nbsp;ลักษณวิศิษฏ์ &nbsp; &nbsp;รองนายกรัฐมนตรีและรมว.พาณิชย์ เปิดเผยภายหลังเข้าร่วมการประชุมรัฐมนตรีการค้าเอเปค (Ministers Responsible for Trade Meeting: MRT 2021)เมื่อคืนวันที่ 5 มิ.ย. ผ่านระบบการประชุมทางไกล &nbsp;โดยได้เสนอประเด็นสำคัญ ต่อที่ประชุม คือ การรับมือกับวิกฤตเศรษฐกิจจากโควิด-19และการค้าระบบพหุภาคีภายใต้การกำกับของ WTO</p><p>ทั้งนี้ไทยสนับสนุนการเคลื่อนย้ายวัคซีนและสินค้าจำเป็นต่อการแก้ปัญหาโควิด โดยการลดอุปสรรคทางการค้า และมาตรการในการจำกัดการส่งออกเพื่อให้ทุกประเทศสามารถเข้าถึงวัคซีน และสินค้าจำเป็นต่อการแก้ปัญหาโควิดได้โดยสะดวกรวดเร็ว</p><p>นอกจากนี้ไทยยืนยันที่จะปฏิบัติตามข้อตกลงในการอำนวยความสะดวกทางการค้าภายใต้กติกาของ WTO พร้อมกับเร่งฉีดวัคซีนให้กับประชาชนให้ทั่วถึงตามเป้าหมายโดยเร็ว และสนับสนุนการเข้าถึงวัคซีนของทุกประเทศในโลก</p>",
  "createdAt": {
    "$date": "2021-06-06T07:58:55.541Z"
  },
  "updatedAt": {
    "$date": "2021-06-06T07:58:55.541Z"
  }
}]